In [3]:
import pandas as pd
import seaborn as sns

In [19]:
avo_df = pd.read_csv('avocado.csv', usecols = ['Date', 'AveragePrice', 'year', 'region'])

avo_df.head()

         Date  AveragePrice  year  region
0  2015-12-27          1.33  2015  Albany
1  2015-12-20          1.35  2015  Albany
2  2015-12-13          0.93  2015  Albany
3  2015-12-06          1.08  2015  Albany
4  2015-11-29          1.28  2015  Albany

In [21]:
avo_df = avo_df.loc[avo_df.region == 'Atlanta']

avo_df.head()

          Date  AveragePrice  year   region
52  2015-12-27          0.99  2015  Atlanta
53  2015-12-20          1.08  2015  Atlanta
54  2015-12-13          0.96  2015  Atlanta
55  2015-12-06          1.07  2015  Atlanta
56  2015-11-29          0.99  2015  Atlanta

In [102]:
avo_df.shape

(338, 4)

In [103]:
df_15 = pd.read_csv('unmerged-census-data/2015-atlanta-census.csv', header=0, names=['group', '2015'])
df_16 = pd.read_csv('unmerged-census-data/2016-atlanta-census.csv', header=0, names=['group', '2016'])
df_17 = pd.read_csv('unmerged-census-data/2017-atlanta-census.csv', header=0, names=['group', '2017'])
df_18 = pd.read_csv('unmerged-census-data/2018-atlanta-census.csv', header=0, names=['group', '2018'])

                                                group     2016
0                                              Total:  472,506
1                             Not Hispanic or Latino:  449,408
2                                         White alone  178,077
3                     Black or African American alone  237,590
4             American Indian and Alaska Native alone      951
5                                         Asian alone   20,253
6           Native Hawaiian and Other Pacific Isla...      170
7                               Some other race alone      481
8                                  Two or more races:   11,886
9                 Two races including Some other race    1,236
10              Two races excluding Some other rac...   10,650
11                                Hispanic or Latino:   23,098
12                                        White alone   12,815
13                    Black or African American alone    2,612
14            American Indian and Alaska Native alone    1,944
15                                        Asian alone      197
16          Native Hawaiian and Other Pacific Isla...       39
17                              Some other race alone    3,482
18                                 Two or more races:    2,009
19                Two races including Some other race      578
20              Two races excluding Some other rac...    1,431

In [143]:
cens_df = pd.merge(df_15, df_16['2016'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_17['2017'], left_index=True, right_index=True, how = 'left')
cens_df = pd.merge(cens_df, df_18['2018'], left_index=True, right_index=True, how = 'left')

cens_df['2015'] = cens_df['2015'].str.replace(',', '').astype(int)
cens_df['2016'] = cens_df['2016'].str.replace(',', '').astype(int)
cens_df['2017'] = cens_df['2017'].str.replace(',', '').astype(int)
cens_df['2018'] = cens_df['2018'].str.replace(',', '').astype(int)

cens_df

,group,2015,2016,2017,2018
0,Total:,463875,472506,486299,498073
1,Not Hispanic or Latino:,445222,449408,465421,475094
2,White alone,176998,178077,179296,189230
3,Black or African American alone,239159,237590,253556,252493
4,American Indian and Alaska Native alone,652,951,374,495
5,Asian alone,20335,20253,19551,19875
6,Native Hawaiian and Other Pacific Isla...,147,170,0,142
7,Some other race alone,265,481,2129,1324
8,Two or more races:,7666,11886,10515,11535
9,Two races including Some other race,405,1236,144,471
10,Two races excluding Some other rac...,7261,10650,10371,11064
11,Hispanic or Latino:,18653,23098,20878,22979
12,White alone,12155,12815,11119,14285
13,Black or African American alone,1440,2612,3332,1277
14,American Indian and Alaska Native alone,651,1944,330,323
15,Asian alone,81,197,0,144
16,Native Hawaiian and Other Pacific Isla...,316,39,0,0
17,Some other race alone,2282,3482,4409,5214
18,Two or more races:,1728,2009,1688,1736
19,Two races including Some other race,529,578,766,571
20,Two races excluding Some other rac...,1199,1431,922,1165

In [ ]:
cens_df['group'] = cens_df['group'].str.replace([])

In [145]:
years = ['2015', '2016', '2017', '2018']

# piv_cens = cens_df.pivot_table(columns = 'group', index = years)

piv_cens = pd.pivot_table(data = cens_df, values =['2015', '2016', '2017', '2018'], columns="group")

piv_cens

group,Total:,Hispanic or Latino:,Not Hispanic or Latino:,American Indian and Alaska Native alone,Asian alone,Black or African American alone,Native Hawaiian and Other Pacific Islander alone,Some other race alone,Two or more races:,White alone,"Two races excluding Some other race, and three or more races",Two races including Some other race
2015,463875.0,18653.0,445222.0,651.5,10208.0,120299.5,231.5,1273.5,4697.0,94576.5,4230.0,467.0
2016,472506.0,23098.0,449408.0,1447.5,10225.0,120101.0,104.5,1981.5,6947.5,95446.0,6040.5,907.0
2017,486299.0,20878.0,465421.0,352.0,9775.5,128444.0,0.0,3269.0,6101.5,95207.5,5646.5,455.0
2018,498073.0,22979.0,475094.0,409.0,10009.5,126885.0,71.0,3269.0,6635.5,101757.5,6114.5,521.0

In [148]:
piv_cens.shape

(4, 12)

In [149]:
cens_df.to_excel(excel_writer= 'atlanta-census.xlsx' , sheet_name='2015-2018')

In [147]:
piv_cens.to_excel(excel_writer= 'piv_atlanta-census.xlsx', sheet_name= '2015-2018')

In [ ]:
'''
THINGS TO DO:
-Change Hispanic to H-
-
'''